In [112]:
import pandas as pd

In [113]:
df = pd.read_csv('teste.csv', sep=',')

In [114]:
df

   idt     nome      endereço      cidade
0  NaN  juliana         Rua 1  araraquara
1  NaN  everton    Rua gandur   Sao Paulo
2  NaN    laura          Av 7  Sao Carlos
3  NaN    carol      av cinco       Bahia
4  NaN   fatima    boa esp 10       Bauru
5  NaN   Marcos  22 de agosto     Guaruja

In [116]:
print(df['idt'].isnull().sum())

6

In [117]:
df.idt = df.idt.fillna('')
print(df['idt'].isnull().sum())

0

In [118]:
C0 = df.columns[0]
C1 = df.columns[1]
C2 = df.columns[2]
C3 = df.columns[3]

In [119]:
for indice, linha in df.iterrows():
    print('''INSERT INTO TABELA ({}, {}, {}, {}) VALUES ({}, {}, {}, {});'''
          .format(C0, C1, C2, C3, linha['idt'], linha['nome'], linha['endereço'], linha['cidade']))

INSERT INTO TABELA (idt, nome, endereço, cidade) VALUES (, juliana, Rua 1, araraquara);
INSERT INTO TABELA (idt, nome, endereço, cidade) VALUES (, everton, Rua gandur, Sao Paulo);
INSERT INTO TABELA (idt, nome, endereço, cidade) VALUES (, laura, Av 7, Sao Carlos);
INSERT INTO TABELA (idt, nome, endereço, cidade) VALUES (, carol, av cinco, Bahia);
INSERT INTO TABELA (idt, nome, endereço, cidade) VALUES (, fatima, boa esp 10, Bauru);
INSERT INTO TABELA (idt, nome, endereço, cidade) VALUES (, Marcos, 22 de agosto, Guaruja);